app/Controllers/customer/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'manishkumarce13@gmail.com'
 LIMIT 1
---
    public function login_post()
    {
        $validationRules = [
            'email' => 'required',
            'password' => 'required'
        ];

        if (!$this->validate($validationRules)) {
            // If validation fails, return to login with errors
            return redirect()->back()->withInput()->with('validation_errors', $this->validator->getErrors());
        }

        // Get input data
        $username = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $userModel = new UserModel();
        $user = $userModel->where('email', $username)->first();