app/Controllers/contractor/Auth.php


        // Example: save data to database using Model
        $userModel = new UserModel();
        $userModel->save($userData);
---
INSERT INTO `users` (`last_name`, `address`, `city`, `country`, `phone`, `email`, `password`) VALUES ('Alford', 'Omnis ut est exercit', '1', '3', '4956464198432', 'vepe@mailinator.com', '$2y$10$csFjJIMEZd425vqr5ioNMeohi0.m7iSBj68seV9kBOSMxMIoQApGC')