app/Helpers/custom_helper.php

SELECT *
FROM `projects`
ORDER BY `created_at` DESC
 LIMIT 10
---
function getLatestProjects()
{
    $db = db_connect();
    $query = $db->table('projects')
        ->select('*')
        ->orderBy('created_at', 'DESC')
        ->limit(10)
        ->get();