app/Models/CountryModel.php

SELECT *
FROM `countries`
---
    public function getAllCountries()
    {
        return $this->get()->getResultArray();