app/Models/ProjectModel.php

    public function getAllProjects(){
        return $this->findAll();
---
SELECT *
FROM `projects`