app/Models/UserModel.php

    public function getUserDetailsById($id)
    {
        return $this->where('id', $id)->get()->getRowArray();
---
SELECT *
FROM `users`
WHERE `id` = '1'

    public function updateProfile($id, $data)
    {
        return $this->where('id', $id)->set($data)->update();
---
UPDATE `users` SET `first_name` = 'Rajendra', `last_name` = 'Panwar', `phone` = '9389882749', `country` = 'IND', `city` = 'Dehradun', `address` = 'Vijay Colony'
WHERE `id` = '1'